There are no Detail Groups in this Project or Family.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId NoDetailGroups { get; }
  Visual Basic
Public Shared ReadOnly Property NoDetailGroups As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ NoDetailGroups {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures GroupFailures Class
  Autodesk.Revit.DB Namespace